hello_message = ' привет! Мы с тобой будем играть в игру "Конфеты".\n \n' \
                'Правила:\n' \
                '1. на столе лежит 2021 конфетa\n' \
                '2. каждый по очереди берет от 1 до 28 конфет\n' \
                '3. выигрывает тот, кто забирает последнюю конфету со стола.\n \n' \
                'Если хочешь увеличить число конфет на столе, до начала игры введи /set_count новое число конфет.\n \n' \
                'Для старта игры введи команду /new_game\n \n' \
                'До начала игры или в процессе игры можно переключить уровень сложности: /level \n' \
                'По умолчанию стоит "легкий" уровень. \n \n' \
                'Чтобы остановить игру, набери /stop_game \n \n' \
                'Команда /help - покажет все доступные команды.'

help_message = 'Команды для игры: \n' \
               '1. Описание игры и общие правила: жми  /start \n' \
               '2. Увеличить число конфет на столе (до старта игры):  /set_count пробел новое число конфет. \n' \
               '3. Старт новой игры:  /new_game \n' \
               '4. Переключить уровень сложности:  /level \n' \
               '5. Остановить игру:  /stop_game'
