import pandas as pd

print('----'*30)
print('Табель учеников школы 1121')

stud_card = {
        'ID': ['01','02','03','04','05'],
        'Имя' : ['Иван','Сергей','Мария','Ольга','Ева'],
        'Фамилия': ['Иванов','Сергеев','Белова','Утка','Мирная'],
        'Дата рождения' : ['10.09.2001','12.04.2002','09.08.2000','24.05.2001','18.01.2003'],
        'Успеваемость' : ['Отличник','Троечник','Хорошист','Отличник','Хорошист']
}

sc = pd.DataFrame(data = stud_card)

with open('students.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{sc}')
        cl.write('\n')

print(sc)
